{
  "culture": [
    { "id": 1, "name": "language", "photo": "culture/culture1.png", "title": "Мова та література", "description": "Українська мова є державною мовою країни і використовується в основному в усіх сферах суспільного життя. Українська література має багату історію, знамениті письменники." },
    { "id": 2, "name": "art", "photo": "culture/culture2.png", "title": "Мистецтво", "description": "Україна славиться своєю народною та сучасною художньою творчістю. Фольклорна традиція, українське вишивання, різноманітні народні музичні інструменти, як от бандура та кобза, і мальовничий розпис гончарних виробів є важливими елементами українського мистецтва." },
    { "id": 3, "name": "music-and-dancing", "photo": "culture/culture3.png", "title": "Музика та танці", "description": "Українська музика та танці мають глибокі корені в історії країни. Фольклорні та народні мелодії часто використовуються як важливий елемент української культури. Традиційні українські танці, такі як гопак, гуцулка, аркан, також є невід'ємною частиною національної культури." },
    { "id": 4, "name": "cooking", "photo": "culture/culture4.png", "title": "Кулінарія", "description": "Українська кухня відома своєю смачною та поживною їжею. Борщ, вареники, голубці, сало з часником та інші страви є популярними та символічними для української кухні." },
    { "id": 5, "name": "architecture", "photo": "culture/culture5.png", "title": "Архітектура та історичні пам'ятки", "description": "Україна має багато вражаючих історичних пам'яток та архітектурних шедеврів, які свідчать про багату культурну спадщину країни. Наприклад, Львів, Київ, Одеса та інші міста відомі своїми старовинними будівлями, церквами та замками." },
    { "id": 6, "name": "modern-culture", "photo": "culture/culture6.png", "title": "Сучасна культура", "description": "Розвиток сучасної української культури відбувається в різних напрямках, включаючи літературу, кіно, музику, театр та мистецтво. Українські художники, музиканти та кінематографісти активно працюють над творенням нових творів та висвітленням сучасних соціокультурних та політичних реалій." }
  ]
}